{"pageProps":{"frontmatter":{"title":"Getting Started with AKM Modeller","date":"Oct 18, 2021","excerpt":"AKM Modeller is a tool for modeling, creating and managing AKM models and metamodels.  This Guide help you getting starte and show  you how to load and save Project with models and metamodels from local Json-files. These files can also be syncronized with a GitHub Repository","cover_image":"images/posts/overview/image00.png"},"slug":"003-GettingStarted","content":"\n## Introduction\n\nAKM Modeller is a tool for modeling, creating and managing AKM models and metamodels.\nThe models are stored in Json-files and can be loaded and saved from local and GitHub.\n\ntable of contents:\n\n  - [Getting Started](#getting-started)\n  - [Loading a model project](#loading-a-model-project)\n  - [Saving a model project](#saving-a-model-project)\n  - [Crash Recovery](#crash-recovery)\n  - [Using GitHub](#using-github) \n \n---\n\n## Getting Started\n\nWhen you start AKM Modeller you will see a welcome screen.\n\n![Homepage](/images/posts/overview/image00.png)\n\nHere you will find some useful information about AKM (Active Knowledge Model) and the AKM Modeller Tool.\nThere are more information about AKM Modeller in the [About page](/about).\n\nOpen the modeller by clicking on the modelling page in the top menu.\n\n![Modellingpage](/images/posts/overview/image01.png)\n\nAn initial project will be opened. \n\n![Modellingpage](/images/posts/overview/image02.png)\n\n---\n\n- [-back to the top-](#introduction)\n  \n---\n\n## To start a new model project\n\nClick on the \"GitHub\" button in the modelling menu to open the GitHub download dialog.\n\nFill in the dialog:\n\nRepoOwner: \"Kavca\"  \nRepository: \"kavca-akm-models\"  \nPath: \"startmodels\"  \n\nClik the \"LIST MODELS\" button to list the models in the repository.\nSelect one of the start models and click \"DONE\"\n\nTo rename the project, model and modelview, select the \"_ADMIN_MODEL in the model dropdown menu.\n\n- Change the name of the project object to your project name.\n- Change the name of the Model object to your model name.\n- Change the name of the Modelview object to your modelview name, i.e. \"01-Main\".\n\nRight click the background and select \"Update Project from AdminModel.\n\nClick refresh (Blue text in the top right corner)\n\nNow you can start modeling.\n\n---  \n\n- [-back to the top-](#introduction)  \n  \n---\n\n## Loading a model project\n\nTo load a project from a local file you can use the following command:\n\n1 Click on the blue \"Model file\" button at the top of the modelling area. \n\n![Modellingpage](/images/posts/overview/image03.png)\n\n2 Click on the \"Choose file\" button and Select the model file you want to load (.json file).\n\n![Open File](/images/posts/overview/image04.png)\n\n3 Click on the \"Done\" button.\n\nThe project will be loaded and the modelling area will be filled with the new model.\nThe project might have more than one model. To select a model you can click on the model name (4) in the top right.\n\n4 Select the model you want to load.\n\n---\n - [-back to the top-](#introduction)\n---\n\n## Saving a model project\n\nTo save a project to a local file you can use the following command:\n\n\"Save Project (all) to file\"\n\n![Modellingpage](/images/posts/overview/image05.png)\n\nThis will save all models and metamodels in the project to a local file.\n\nIn the same way you can save a model or a modelview to a local file with the buttons \"Save Current Model to file\" and \"Save Current Modelview to file\".\n\nYou can also save the metamodel to a local file with the button \"Save Current Metamodel to file\".\n\n---\n - [-back to the top-](#introduction)\n---\n\n## Crash Recovery\n\nIn case of a crash or hang (browser not responding) you can recover the last refreshed version of the current project from the Browser LocalStorage.\n\n- Fist clikc on the Local (white button) at the top of the modelling area.\n- Then Click on the \"Recover Project ( last refreshed version\" button at the bottom of the dialog vindow.\n- \n\n---\n - [-back to the top-](#introduction)\n---\n\n## Using GitHub\n\nUsing GitHub to store your model projects.\n\nBecause the Project model files are Json-files, you can also store your model projects in GitHub repository.\nCreate a repository in GitHub and add a folder were you can store your model files.\nClone the repository to your local computer and open and save your model project file from you local repository as described above.\n\nWhen you have savee your project, you can **Add, Commit and Push** your repository to GitHub as normal.\n\n---\n - [-back to the top-](#introduction)\n---"},"__N_SSG":true}