{"pageProps":{"frontmatter":{"title":" A Concept model and test of the Solution Model","date":"June 8, 2022","excerpt":"An example of dynamic change of a Concept model and the Solution Model. The purpose of this tutorial is to show how to make enhancement to an existing Consept Model of rental service for e-Scooters and generate a metamodel and test the metamodel with a test Solution Model .","cover_image":"images/posts/escooter/image_020-1.png"},"slug":"0031-eScooter","content":"<details><summary markdown=\"span\">\n    Test Solution Model?\n    </summary>\n\nA test Solution Model is a model that is used to test the Concept Model and the generated Metamodel.\nThe purpose of the test model is to \"instanciate\" the Concepts and create examples to test if the Concept Model is working as expected.\nIf changes are needed, we go back to the Concept Model and make the changes necessary and regenerate the metamodel for a new test.\n\nIf we are satisfied, we can export the type definitions to i.e. GraphQL typedefinition file and create Queries / Mutations from the Tasks.\n\n</details>\n\n---\n\n## This example will show how to expand and enhance an existing concept model of rental service for E-Scooters.\n\n\n### Concept Model overview\n\nWe start with a current concept model of the rental service. The user can locate and rent an e-Scooter for a period of time. The user will release the e-Scooter for others to use at the end of the period. \nA Model consists of a set of objects and relationships between these objects. This Model is a **Concept Model** wich consists of a set of objecttypess and relationshiptypes.\nThe model can have several Modelviews. Each modelview is a set of objectviews and relationshipviews that is used to display sertain aspects of the model.\n\nThe modelview (picture below) contains the object/information types needed in a rental service for E-scooters. \nIn the \"Type definition\" container at the right you se currently defined Objecttypes Types: \"**Person**\", \"**Company**\", \"**Fleet**\", \"**Location**\", \"**Vehicle**\", \"**EScooter**\", with Relationship Types \"**has**\" and \"**contains**\".\n\nIn the left container we have the predefined (from IRTV-metamodel ) objects **Role** and **Tasks** used for the rental service.\n\n![alt text](/images/posts/escooter/image_020-1.png)\n\nA person fills the role of User that performs the task of renting an E-scooter.\nThe person has a position (coordinates) which is used to determine the location where to search for nearby E-scooters.\nThe rental service is based on the concept of a fleet of E-scooters.\nThe fleet is a collection of vehicles which consists of E-scooters.\n\n\n---\n\n### Adding Properties and relationship for the Person, Position and Vehicle Objecttypes.\n\nTo define more details in the model, we ad new Modelviews.\n\nBelow we see the definition of the properties and relationships for the **Person**, and **Vehicle** in a new Modelview.\n\nVehicle also has a relationship to **Position** objecttype, that contains the GPS coordinates of the vehicle.\nOn the right side of the modelview we see some of the datatype definition for the properties. The default datatype is \"String\".\n\n<details><summary markdown=\"span\">\n    Modelview with properties and relationships for the Person and Vehicle Objecttypes.\n    </summary>\n\n![alt text](/images/posts/escooter/image_020-2.png)\n\n</details>\n\n---\n\n### Adding Properties and relationships for the Vehicle and E-Scooter Object Types.\n\n where we add the properties and relationships shown below. The **Vehicle** and **E-Scooter**, is defined. \nThe Vehicle has some special properties for the rental service, like **vehicleId** and **price**. Vehicle also is related to **Position** that contains the GPS coordinates of the vehicle.\n\n<details><summary markdown=\"span\">\n    Modelview with properties and relationships for the Vehicle and E-Scooter Object Types\n    </summary>\n\n\n![alt text](/images/posts/escooter/image_020-3.png)\n\n</details>\n\n---\n\n### Adding Datatype, Inputpatterns and Value definitions\n\nThe datatype definition for the properties is shown below. \nA DataType can have list fo allowed values.\nThe DataType can also have defined a InputPattern which is a regular expression that defines the allowed values for a property.\n\n<details><summary markdown=\"span\">\n    Modelview for the datatype definition\n    </summary>\n\n![alt text](/images/posts/escooter/image_020-4.png)\n\n</details>\n\n---\n\n### Adding Details for the Tasks of locating the User and the Vehicles\n\nVi can define a View for specific Tasks. The View can be used to define the properties that are used in that Task.\nBelow you can se that the Locate Vehicle Task uses the GPS coordinates for the Person and the of the vehicles to find vehicles nearby.\n\n<details><summary markdown=\"span\">\n    Modelview of the locate user and vehicle tasks\n    </summary>\n\n![alt text](/images/posts/escooter/image_020-5.png)\n\n</details>\n\n---\n---\n\n    Now we can generate a Metamodel from the Concept model\n\n---\n\n\n## Metamodel.\n\nFrom the Concept model (Type definition), we can now generate a Metamodel that appears in the as Types in the palette on left side in the Solution model. \nThis Types are used to build the solution test model by creating instances of the object and relationship types.\n\n#### Generated objecttypes\n\n<details><summary markdown=\"span\">\n    The Generated metamodel\n    </summary>\n\n![alt text](/images/posts/escooter/image_020-6.png)\n\nIn the left palette, we see the generated metamodel types.\nThe relationships are also generated, and is avaiable to connect the objects in the Canvas.\n\n</details>\n\n---\n\n#### Copied role and tasks objects\n\nThe Rols and Tasks are exported(copied) from the Concept model and can now be used in the solution model.\n\n<details><summary markdown=\"span\">\n    Exported Roles and Tasks\n    </summary>\n\n![alt text](/images/posts/escooter/image_020-6b.png)\n\nIn the left palette, we see the Roles and Tasks that are exported from the Concept model.\n\n</details>\n\n\n\n\n---\n\n\n### The Solution Test model.\n\nThe generated Metamodel vil be used as Metamodel for the Solution model.\nThe Object types are shown below in the Palette types at the left.\n\n<details><summary markdown=\"span\">\n    Testmodel for the solution\n    </summary>\n\n\n![alt text](/images/posts/escooter/image_020-8.png)\n\n\n\n![alt text](/images/posts/escooter/image_020-7.png)\n \n </details>\n\n ---\n\n<details><summary markdown=\"span\">\n    How to create instances from the objecttypes\n    </summary>\n    Drag and drop the objecttypes from the Palette to the Canvas (Modelling area).\n    Right click on the object and select \"Edit Object\" to open the property dialog to add attribute values.\n    <img src=\"/images/posts/escooter/image_020-35.png\" alt=\"alt text\" width=\"100%\">\n</details>\n\n---\n\n### Add Role and Tasks for maintenance and repair of e-scooters.\n\nWe now want to add new Tasks for maintenance and repair of E-scooters.\nWe start with copying the Type definition model from the 01-ConseptRental Modelview, and paste view into the 01.1-ConseptMaint modelview. \nThen we add a new Container \"Task Model Maintenance\" where we add the new Tasks and Roles.\nThen we add relationships to the Type definition model.\n\n<details><summary markdown=\"span\">\n    Consept model for the maintenance and repair of e-scooters\n    </summary>\n\n![alt text](/images/posts/escooter/image_020-22.png)\n\n</details>\n\n---\n\n#### Test the updated Solution Model completed with the maintenance and repair of e-scooters\n\nBelow is a test of the solution model, where we use the generated metamodel.\n\nIf we are not satisfied with the result, we can change the Concept model again and rerun the generation.\n\n![alt text](/images/posts/escooter/image_020-?.png)\n\n---\n\n---\n"},"__N_SSG":true}