{"pageProps":{"frontmatter":{"title":"Modifying your Type Definition Model","date":"November 8, 2021","excerpt":"Detailing the Type Definition Model by adding properties and specifying typeviews","cover_image":"images/posts/modelling/image_model002.png"},"slug":"006-ModifyingAMetamodel","content":"\n## Modify the type definition model\nIf something is wrong in your metamodel, or you want to change anything, go back to the type definition model, do the necessary changes, and generate the metamodel again.\n\nIf you want to add symbols and colors to your types, go back to your type definition model to add view specifications, and generate the metamodel again.\n\nThe view specifications are done by editing “*Object View*” of the “*EntityType*” objects and by editing “*Relationship View*” of the “*isRelatedTo*” relationships. \nThe “*Object View*” and “*Relationship View*” definitions are used to define the corresponding “*Object Typeview*” and “*Relationship Typeview*” definitions in the generated metamodel.\n\n### Detailing the type definition model\n\nThe first thing you do when you want to add more details to your metamodel than just defining object and relationship types is to add properties to your object types. This is done in the model of your metamodel. \nFor example, in our test metamodel defined above, we could add properties to “Person”, like:\n\n    -   Phone number\n    -   Email address\n    -   Birth date\n    -   Etc.\n\nAnd to the “House”:\n\n    -   Address\n    -   Size\n    -   Year built\n    -   Etc.\n\nIf you do that, and then regenerate the metamodel, those properties will appear as attributes in the “*Edit Object*” dialog of the \"*Person*\" and \"*House*\" objects.\n\nIf nothing further is said about the properties, they will all be “*string*” properties, with no restrictions on the values.\n\nBy adding “*Datatype*” to a property, you start adding constraints to the allowed values. The potential constraints are covered by the part of the AKMM initial metamodel, shown in the figure below.\n\n![alt text](/images/posts/modelling/image_model0351.png)\n\nThe built-in datatypes are:\n\n    -\tstring\n    -\tinteger\n    -\tnumber\n    -\tboolean\n    -\tdate\n\nAll custom datatypes will be based on one of these. This means that you as a metamodeller can define your own datatypes that combine the built-in types with additional specifications. \n\nE.g., to define an enumeration list, you may define:\n\n    -\tone or more \"hasAllowed\" relationships to a \"Value\"\n    -\tone \"isDefault\" relationship to one of the \"Values\"\n\nCombine this with a **FieldType** “*radio*” or “*select*” and this field will in the property dialog appear as a dropdown list, with the default value being the initial value.\n\nThe **FieldTypes** currently supported by the Modeller are the following:\n\n    -\tcheckbox\n    -\tcolor\n    -\tdate\n    -\temail\n    -\tfile\n    -\timage\n    -\tmonth\n    -\tnumber\n    -\tpassword\t\n    -\tradio\n    -\trange\n    -\tselect\n    -\ttext\n    -\ttextarea\n    -\ttime\n    -\turl\n    -\tweek\n\n**InputPatterns** are used to check if values entered by the user are valid / allowed values. \nThe mechanism to check this is “**Regular Expressions**”. A regular expression engine has been embedded in AKMM for this purpose.\nRef: https://www.w3schools.com/jsref/jsref_obj_regexp.asp \nand https://www.regular-expressions.info/examples.html\n\n**ViewFormats** are included as a mechanism to format how attribute values are shown in dialogs. The formatting mechanism used is the **printf** C functions family, implemented in Javascript.\nRef: https://alvinalexander.com/programming/printf-format-cheat-sheet/\n\n#### Containers\n\nIf you want an object to be visualized as a container, then you should change the value of the \"*viewkind*\" attribute. This attribute has two values: “*Object*” and “*Container*”. \n\nA “*Container*” acts like a folder in a file system, you can put objects inside the container and those objects will follow the container when the container is moved. The effect of changing the value from \"*Object*\" to \"*Container*\" is illustrated below:\n\n![alt text](/images/posts/modelling/image_model0361.png)\n\nTo the left we see two object views of the same object, both with “*viewkind*” having the value “*Object*”. To the right we see the same object views, but in the one to the right “*viewkind*” has the value “*Container*”.\n\nBUT: If you want a generated type to behave like a container, you need to give “*viewkind*” of the “*Object*” the value “*Container*”. In this case the value in the “*Objectview*” is ignored when the metamodel is generated.\n"},"__N_SSG":true}