{"pageProps":{"frontmatter":{"title":"Integration with the OSDU Data Platform","date":"Oct 19, 2021 sf","excerpt":"The Open Subsurface Data Universe Data platform contains a set of standardized data definitions and Object types that is used to when ingesting data into the platform. The core functionality of this module consists of the ability to import and export OSDU Json files to AKM models.","cover_image":"images/posts/osdu/image001.png"},"slug":"010-Osdu_json","content":"\n## Introduction  \n\nThe OSDU (Open Subsurface Data Universe) Data platform, contains a set of standardized data definitions and Object types with properties and relationsips, that is used when ingesting data into or extracting data from the platform. The core functionality of this module, consists of the ability to import and export Json files according to these definitions. JSON is a lightweight data interchange format, and has become a popular standard format for exchanging data between applications. Even if JSON is human readable, it is not easy to see and identify the relationships between the data (Json-files). This AKM module provides a way to import and export OSDU Json files from/to AKM models.\n\nThe AKM model presents the complex Json-file structure and relatioships between the ObjectTypes in a user firendly graphical and a more understandable and concise way.\n\nThis makes it easy to edit and expand the Metamodels to embrace new product categories. The Object types are enhanced and expanded by adding new properties and relationships. The new enhanced models can then be exported as Json-files for import into the OSDU Data platform.\n\nTable of contents:\n\n  - [Extensions of the IRTV-Metamodel](#extensions-of-the-irtv-metamodel)\n  - [Importing the OSDU Metamodel types](#importing-the-osdu-metamodel-types)\n  - [Importing a OSDU Json-file to an AKM Model type](#importing-a-osdu-json-file-to-an-akm-model-type)\n  - [Importing the OSDU Json-file as a Json structure model](#importing-the-osdu-json-file-as-a-json-structure-model)\n\n---\n\n## Extensions of the IRTV Metamodel\n\nThe AKM extensions of the Osdu-Metamodel are built on the AKM IRTV-Metamodel (see separate description in th Help documentation). These extensions will enable the capabilities of the IRTV-Metamodel to include specific Json objects and attributes, that represent the structure of Json-file object structure.\n\nThe EntityType Objecttype is extended to include some osdu and json-file specific properties.\n\n        -name\n        -osduId\n        -jsonType\n        -osduType\n        -jsonKey\n\nThe EntityType Property is extended to include OSDU and Json-file specific properties.\n\n        -title\n        -pattern\n        -example\n\n![alt text](/images/posts/osdu/image001.png)\n\n\n*This model is a **Type Definition Model** that defines the types, structure and content of the OSDU Json-file.*  \n\nAs shown in the figure above, the  -name, -osduId, -title, -pattern and example properties can be of a long text, and therefore defined as Datatype **textarea**\n\nThe -jsonType and -osduType are defined as enum Datatypes, and connected to Value objects with **hasAllowed** and **isDefault** relationships.\n\nTwo new EntityTypes are added:\n\n**JsonObject** and **JsonArray** are used to represent objects and arrays in a Json-file. The relationships **hasMember** is used to represent members of Json-file arrays. The relationships **hasPart** is used to represent the structure of the Json-file object tree.\n\n\nTo generate a metamodel from this model, right-click on the background and choose **Generate Metamodel** command. \nA dialog-box will appear asking \"Do you want to include system types\". Click Ok to include system types. \nA new dialog-box will appear where you can select which metamodel you want to generate.\n\n\n(Note: A metamodel has to exist before you can generate a metamodel from a concept model.  On the background menu choose **New Metamodel** to create a new metamodel.)\n\n## Importing the OSDU Metamodel types\n\nNow the OSDU Metamodel is ready to be used to create a new OSDU Type Definition Model (_TDM).:\nOn the background menu select the **Create New Model** to create a new _TDM model.\nYou will then be asked which Metamodel to use so select the appropriate Metamodel.\n\nOpen the new model, and on the left side you see the palette with the generated metamodel types.\n\n![alt text](/images/posts/osdu/image002.png)\n\n---\nSelect the MM tab on the left side and you will see the OSDU metmodel with both the IRTV and OSDU metamodel object and relationship types. This is the available types that can be used to model new consept models.\n\n![image3](/images/posts/osdu/image003.png)\n\n---\n - [-back to the top-](#introduction)\n---\n\n## Import (Open) an OSDU Start-up Model (Json-file)\n\nClick on the **Model file** button (blue button) to open the Import dialog and then Click on  the **Choose file** button to select a file to import.\n\n![alt text](/images/posts/osdu/Screenshot2021-10-20at02.13.36.png)\n\nThen click Done button\n\n---\n - [-back to the top-](#introduction)\n---\n\n## Importing an OSDU Json-file to an AKM Model type\n\nThen click the **OSDU Json file (1)** button to open the Import dialog and then click on the **Choose file (2)** button in the blue area to select an **OSDU JSON file** to import. Then click the **Done (3)** button.\n\n![alt text](/images/posts/osdu/Screenshot2021-10-20-5.png)\n\nClick on the modelview tab **Main (1)** or **refresh (2)** (upper right) to refresh the model.\nThen click on the **Objects (3)** tab to see the imported objects. Find and drag the top level object (i.e. Wellbore) **(4)** to the modelview **(5)**.\n\n![alt text](/images/posts/osdu/Screenshot2021-10-20-4.png)\n\nThen right-click the object and choose **Add Connected Objects** to add the child objects.\nType in the number of levels to add in the dialog-box.\n\n![alt text](/images/posts/osdu/Screenshot2021-10-20-2.png)\n\nThe imported **EntityType** with properties is added to the modelview.\n\n![alt text](/images/posts/osdu/Screenshot2021-10-20-1.png)\n\nIf you want to add more objects, you can now add them to the modelview.\n\n---\n - [-back to the top-](#introduction)\n---\n\n## Importing the OSDU Json-file as a Json structure model\n\nThen click the **Choose file** button in the green OSDU Json file structure to open the Import dialog and then Click on the **Choos file** button to select an **OSDU JSON file** to import. Then click the Done button. \n\nFind and drag the top level object (i.e. Wellbore.1.0.0.json) into the Modelling area.\n\n![alt text](/images/posts/osdu/image007.png)\n\nThen right-click the object and choose **Add Connected Objects** to add the child objects.\nType in the number of levels to add in the dialog-box.\n\n![alt text](/images/posts/osdu/image008.png)\n\nThe imported **EntityType** with properties is added to the modelview.\n\n![alt text](/images/posts/osdu/image009.png)\n\n---\n - [-back to the top-](#introduction)\n---"},"__N_SSG":true}